#!/usr/bin/python
#-*-coding:utf-8-*-
"""格式化操作符%"""
s = "life is short,i used python!"
print("格式化字符串及其ASCII码 : %c " % 99)
print("格式化字符串:%s"%s)
s = 9999
print("格式化整数:%d"% s)
print("格式化无符号8进制数: %o"% 10)
print("格式化无符号16进制数: %x"% 10)
print("格式化无符号16进制数大写: %X"% 10)
print("格式化浮点数字，可以指定小数点后的精度：%.5f"%234567)
print("用科学记数法格式化浮点数字：%.8e"%1234567890)
print("用科学记数法格式化浮点数字：%.8E"%1234567890)
print("根据值的大小决定使用%%f还是%%e :%g"%1234.5)
print("根据值的大小决定使用%%f还是%%e :%g"%1234567890)
print("根据值的大小决定使用%%f还是%%e :%G"%1234.5)
print("根据值的大小决定使用%%f还是%%e :%G"%1234567890)
print("%d 的八进制是:%o"%(12,12))
print("%d 的16进制是:%x"%(12,12))
print("%d 的16进制是:%X"%(12,12))

print("m.n m是显示最小总宽度，n是小数点后的位数: %5.2f"%1234566.6)
print("结果左对齐:%-10d"%5)
print("在正数前面加上+：%+d"%5)
print("%d的8进制数前面显示0o:%#o"%(12,12))
print("%d的16进制数前面显示0x:%#x"%(12,12))
print("%d的16进制数前面显示0X:%#X"%(12,12))
print("显示的数字前面填充'0'代替：%05d"%12)