#!/usr/bin/python3
# -*-coding:utf-8-*-
# Time    :2022/1/15  19:07
# Author  :xyz34
# Email   :xyz349925756@hotmail.com
# File    :字典查询.py
# Project :coding
# 此程序你输入的左右都有空格都能识别
dis = {
    '张三':[26,18123456987,'CEO',8000],
    '李四':[35,13123456666,'CTO',7000],
    '张龙':[43,18823412345,'技术员',3000],
    '赵虎':[51,17923456987,'业务员',4000],
    '王朝':[47,13223456987,'经理',5000],
    '马汉':[34,15923456987,'司机',5000],
    '展昭':[36,15123456987,'CFO',6500]
}

name = input("请输入您要查询的姓名:")
t = name.strip()

if (t in dis) == True:
    print(f"您查询的 {t} 年龄，电话，职位，工资是： {dis[t]}")
else:
    exit(f"您查询的 {t} 不存在，如果你确定有此人，请与管理员联系，联系电话：19912345678")