#！ /usr/bin/python

###################################################################
#								  #
#								  #
#			switch语句				  #
#								  #
#								  #
###################################################################

from __future__ import division
x = 1      #定义了一个操作数
y = 2      #定义了一个操作数
operator = "/"   #定义操作符变量，该变量用于存放算术运算
result = {       #定义字典   该字典由+-*/四个运算符组成。
    " + " : x + y,
    " - " : x - y,
    " * " : x * y,
    " / " : x / y
    }
print(result.get(operator)) #调用get()的方法，get()的参数就是变量operator的值。这里
#operator的值为"/"所以执行的是除运算。

