#！ /usr/bin/python

###################################################################
#								  #
#								  #
#		习题						  #
#								  #
#								  #
###################################################################

x = int(input("输入工资:"))
if x < 3500:
    print("未达到个人所得税条件")
else:
    y = x - 3500
    if y < 1500:
        z = y * (3/100)
        print("应交个人所得税：",z)
    elif 1500 <= y < 4500:
        z = y * (1/10)
        print("应交个人所得税：",z)
    elif 4500 <= y < 9000:
        z = y * (1/5)
        print("应交个人所得税:",z)
    elif 9000 <= y < 35000:
        z = y * (1/4)
        print("应交个人所得税：",z)
    elif 3500 <= y < 55000:
        z = y * (3/10)
        print("应交个人所得税：",z)
    elif 55000 <= y < 80000:
        z = y * (7/20)
        print("应交个人所得税：",z)
    else:
        8000 <= y
        z = y * (9/20)
        print("应交个人所得税：",z)
