#！ /usr/bin/python

###################################################################
#								 	  #
#									  #
#			字典						  #
#									  #
#									  #
###################################################################

dict = {"a":"apple","b":"banana","g":"grape","o":"orange"}
print("这是字典：",dict)
print("这是字典中的“a”键：",dict["a"])

print("*************************************************************")

dict = {"1":"apple","2":"banana","3":"grape","4":"orange"}
print("这是字典：",dict)
print("这是字典中的“2”键：",dict["2"])

print("*************************************************************")

print("%s,%(a)s,%(b)s" % {"a":"apple","b":"banana"})

#{"a":"apple","b":"banana"}是隐式字典。这个字典用来定制print()中的参数列。%s输出这个字典
#%(a)s获取字典中对应的key值a 的value，%（b）s获取字典中对应key值b的value。
