#！ /usr/bin/python

###################################################################
#								  #
#								  #
#	全局变量							  #
#								  #
#								  #
###################################################################

_a = 1   #定义一个a的全局变量
_b = 2   #定义一个b的全局变量
def add():   #定义一个add()函数
    global _a  #global 是用于引用全局变量_a 
    _a = 3    #对全局变量_a重新赋值。
    return "_a + _b =",_a + _b #返回_a + _b的值
def sub():    #定义了一个sub（）函数
    global _b #global 引用全局变量_b
    _b = 4    #重新赋值全局变量_b的值
    return "_a - _b =",_a - _b  
print(add())  
print(sub())
