#！ /usr/bin/python
##################################################################
#			REDUCE的使用					#			
##################################################################
"""
reduce()对序列中元素的连续操作可以通过循环来处理。
"""
def sum(x,y):
    return x + y
from functools import reduce
print(reduce(sum,range(0,10)))
print(reduce(sum,range(0,10),10))
print(reduce(sum,range(0,0),10))

"""
第一行代码，定义了一个函数sum() ，该函数提供2个参数，执行累加操作。
第4行代码，对0,10即0,1,2,3,4,5,6,7,8,9执行累加计算。结果45
第5行代码,对0，10进行累加运算的同时再加10 即 55
第六行代码，由于range(0,0)返回空值，再加10  结果为10
"""
