#！ /usr/bin/python

###################################################################
#								 	  #
#									  #
#			字典的排序					  #
#									  #
#									  #
###################################################################

dict = {"a":"apple","b":"banana","g":"grape","o":"orange"}
print(dict)
print(sorted(dict.items(),key = lambda d: d[0]))
#按KEY排序  d[0]
print(sorted(dict.items(),key = lambda d: d[1]))
#按value排序d[1] 


print("#################################################################")


dict = {"a":"apple","b":"banana"}
dict2 = {"c":"cdrom","d":"dvd"}
dict2 = dict.copy()
print(dict)

print("#################################################################")

import sys
print(sys.modules.keys())
print("#################################################################")
print(sys.modules.values())
print("#################################################################")
print(sys.modules["os"])
print("#################################################################")
