#！ /usr/bin/python

###################################################################
#								  #
#								  #
#			while循环例子2带else			  #
#								  #
#								  #
###################################################################

x = float(input("输入X的值："))#接受用户输入的数字并转换为float类型
i = 0   #定义变量i
while (x != 0):  #给出循环条件x != 0，如果不等于0则执行下面的语句；否则执行else子句的内容。
    if (x > 0):   #判断x的值是否大于0
        x -= 1    #如果x值大于0，每次执行都减1
    else:         #判断变量x的值是否小于0
        x += 1     #如果X值小于0，则每次循环都加1
    i = i + 1      #每次循环使变量i的值加1
    print('第' ,i ,'次循环：',(i,x))  #这里输出跟书上的有差别。！！！！！！！！
else:           #循环结束，else子句输出变量x的值。
    print("x等于0:",x)
